docs: upgrade architecture diagram to mermaid graph
